In [ ]:
# 入门Pandas不可不知的技巧

In [2]:

# 首先，导入包
import pandas as pd
import numpy as np

In [3]:
# 方式1：通过字典直接创建
df1 = pd.DataFrame({
    "name":["小明","小红","小孙","王小","关宇","刘蓓","张菲"],
    "age":[20,18,27,20,28,18,25],
    "sex":["男","女","男","男","男","女","女"],
    "score":[669,570,642,590,601,619,701],
    "address":["北京","深圳","广州","武汉","深圳","广州","长沙"]
})
df1

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙

In [4]:
df1.to_excel('学生信息.xlsx',index=False)

In [5]:
pd.read_excel('学生信息.xlsx')

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙

In [6]:
# shape表示数据是由多少行和列组成：

df1.shape

(7, 5)

In [7]:
# 查看字段属性名称
df1.columns

Index(['name', 'age', 'sex', 'score', 'address'], dtype='object')

In [8]:
# 查看属性的数据类型
df1.dtypes

name       object
age         int64
sex        object
score       int64
address    object
dtype: object

In [9]:
# 查看数据是否缺失
df1.isnull() #  # 如果缺失显示为True，否则显示False

    name    age    sex  score  address
0  False  False  False  False    False
1  False  False  False  False    False
2  False  False  False  False    False
3  False  False  False  False    False
4  False  False  False  False    False
5  False  False  False  False    False
6  False  False  False  False    False

In [10]:
# 统计缺失值的个数。一个True计数一次
df1.isnull().sum()

name       0
age        0
sex        0
score      0
address    0
dtype: int64

In [11]:
# 查看数据行索引
df1.index

RangeIndex(start=0, stop=7, step=1)

In [12]:
# 查看数据描述信息
df1.describe

<bound method NDFrame.describe of   name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙>

In [13]:
# 查看数据统计值
df1.describe() # 统计值信息只会显示类型为数值型的数据统计值信息：
# 统计值的结果包含：个数count、均值mean、方差std、最值min\max、四分位数25%、中位数50%、四分之三分位数75%。

             age       score
count   7.000000    7.000000
mean   22.285714  627.428571
std     4.270608   46.227182
min    18.000000  570.000000
25%    19.000000  595.500000
50%    20.000000  619.000000
75%    26.000000  655.500000
max    28.000000  701.000000

In [14]:
# 03 查看头尾文件
# 通过head和tail方法能够快速查看数据的头尾文件。
df1.head()   # 默认是查看前5行数据

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉
4   关宇   28   男    601      深圳

In [15]:
df1.head(3)  # 指定显示的行数

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州

In [16]:
df1.tail()    # 默认尾部5行

  name  age sex  score address
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙

In [17]:
df1.tail(3)   # 指定尾部3行数据

  name  age sex  score address
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙

In [18]:
# 04 花样取数
# 从pandas的DataFrame数据框中取出我们想要的数据，然后进行处理
# 取出某个字段的数据
# 我们取出name这列的数据：
name=df1['name']
name

0    小明
1    小红
2    小孙
3    王小
4    关宇
5    刘蓓
6    张菲
Name: name, dtype: object

In [19]:
# 取出多个字段的数据
name_age = df1[['name','age']]
name_age

  name  age
0   小明   20
1   小红   18
2   小孙   27
3   王小   20
4   关宇   28
5   刘蓓   18
6   张菲   25

In [20]:
# 1、选择单个数据类型
df1.select_dtypes(include='int64')

   age  score
0   20    669
1   18    570
2   27    642
3   20    590
4   28    601
5   18    619
6   25    701

In [22]:
# 2、同时选择多个类型
df1.select_dtypes(include=['int64','object']) # 因为数据中只有int64,object，所以我们全部选出来了。

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙

In [23]:
# 选择排除某些数据类型之外的数据：
df1.select_dtypes(exclude='int64') # 选择除了int64类型之外的数据

  name sex address
0   小明   男      北京
1   小红   女      深圳
2   小孙   男      广州
3   王小   男      武汉
4   关宇   男      深圳
5   刘蓓   女      广州
6   张菲   女      长沙

In [24]:
# 1、直接通过判断大小来取数：
df1[df1['age']==20] # 年龄等于20

  name  age sex  score address
0   小明   20   男    669      北京
3   王小   20   男    590      武汉

In [25]:
df1[df1['age']!=20] # 年龄不等于20

  name  age sex  score address
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙

In [26]:
df1[df1['age']>=20] # 年龄大于等于20

  name  age sex  score address
0   小明   20   男    669      北京
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉
4   关宇   28   男    601      深圳
6   张菲   25   女    701      长沙

In [28]:
# 多个判断条件连用
df1[(df1["age"] >= 20) & (df1["age"] < 27)]

  name  age sex  score address
0   小明   20   男    669      北京
3   王小   20   男    590      武汉
6   张菲   25   女    701      长沙

In [29]:
# 根据字符串取数
# 1、通过单个条件取数
# 1、单条数据
df1[df1["name"] == "小明"]

  name  age sex  score address
0   小明   20   男    669      北京

In [30]:
# 2、通过多个条件取数
# 选择姓名是小明，或者年龄大于25的数据

df1[(df1['name']=='小明') | (df1['age']>25)]

  name  age sex  score address
0   小明   20   男    669      北京
2   小孙   27   男    642      广州
4   关宇   28   男    601      深圳

In [31]:
# 字符串的开始、结尾、包含函数
# str.startswith(string)
# str.endswith(string)
# str.contains(string)
# 1、取出以“小”开头的姓名
df1[df1['name'].str.startswith('小')]

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州

In [32]:
# 以“关”开始
df1[df1['name'].str.startswith('关')]

  name  age sex  score address
4   关宇   28   男    601      深圳

In [33]:
# 3、以“菲”结尾
df1[df1['name'].str.endswith('菲')]

  name  age sex  score address
6   张菲   25   女    701      长沙

In [34]:
# 取出包含“小”的数据：不管小是在开头，还是结尾都会被选出来
df1[df1['name'].str.contains('小')] # 上面的王小不是小开头，但是包含小，所以也被选出来。

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉

In [35]:
# 字符串取反操作，取反符号是波浪线：~
# 下面的例子是：取出名字name中不包含小的数据，只有3个人名字中没有小字。
df1[~df1['name'].str.contains('小')]

  name  age sex  score address
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙

In [36]:
# 05 切片取数
# 切片是Python中存在的概念，在pandas中同样可以使用。切片中存在3个概念：start、stop、step

# start：起始索引，包含
# stop：结束索引，不包含
# step：步长，可正可负；
# 写法为：[start:stop:step]

In [37]:
# 1、通过下面的3个案例说明：起始索引默认从0开始，步长默认是1
df1[:4]

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉

In [38]:
df1[0:4] # 默认步长为1

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉

In [39]:
df1[0:4:1] # 指定起始、结束索引，步长

  name  age sex  score address
0   小明   20   男    669      北京
1   小红   18   女    570      深圳
2   小孙   27   男    642      广州
3   王小   20   男    590      武汉

In [41]:
# 2、指定起始索引，不指定结束索引，表示一直取到数据末尾
df1[4:]  # 从索引4开始取到末尾

  name  age sex  score address
4   关宇   28   男    601      深圳
5   刘蓓   18   女    619      广州
6   张菲   25   女    701      长沙

In [42]:
# 3、改变步长的值
df1[0:4:2]  # 改变步长：每隔2个值取一行数据

  name  age sex  score address
0   小明   20   男    669      北京
2   小孙   27   男    642      广州

In [43]:
df1[:4:2]  # 默认从0开始

  name  age sex  score address
0   小明   20   男    669      北京
2   小孙   27   男    642      广州

In [45]:
# 4、只指定步长
df1[::2] # 从头到尾，步长为2

  name  age sex  score address
0   小明   20   男    669      北京
2   小孙   27   男    642      广州
4   关宇   28   男    601      深圳
6   张菲   25   女    701      长沙

In [46]:
# 步长为负数
# 1、步长为-1，默认是倒序输出结果
df1[::-1]

  name  age sex  score address
6   张菲   25   女    701      长沙
5   刘蓓   18   女    619      广州
4   关宇   28   男    601      深圳
3   王小   20   男    590      武汉
2   小孙   27   男    642      广州
1   小红   18   女    570      深圳
0   小明   20   男    669      北京

In [47]:
# 2、步长为负，指定起始和终止索引，起始索引大于终止索引
df1[4:0:-1]

  name  age sex  score address
4   关宇   28   男    601      深圳
3   王小   20   男    590      武汉
2   小孙   27   男    642      广州
1   小红   18   女    570      深圳

In [48]:
# 3、起始和终止索引为负数
df1[-1:-5:-1] # 最后一行记录索引为-1，不包含索引为-5的数据

  name  age sex  score address
6   张菲   25   女    701      长沙
5   刘蓓   18   女    619      广州
4   关宇   28   男    601      深圳
3   王小   20   男    590      武汉

In [49]:
# 06 常用函数
# 统计元素个数
# 很多时候我们需要统计某个列中每个元素出现的个数，相当于是做词频统计，使用：value_counts()方法，具体案例为：

# ⚠️：新数据中df1增加了一列：班级class，后续有作用

In [50]:
df1 = pd.DataFrame({
    "name":["小明","小红","小孙","王小","关宇","刘蓓","张菲"],
    "age":[20,18,27,20,28,18,25],
    "sex":["男","女","男","男","男","女","女"],
    "score":[669,570,642,590,601,619,701],
    "address":["北京","深圳","广州","武汉","深圳","广州","长沙"],
    "class":["one","two","one","two","two","one","one"]
})
df1

  name  age sex  score address class
0   小明   20   男    669      北京   one
1   小红   18   女    570      深圳   two
2   小孙   27   男    642      广州   one
3   王小   20   男    590      武汉   two
4   关宇   28   男    601      深圳   two
5   刘蓓   18   女    619      广州   one
6   张菲   25   女    701      长沙   one

In [51]:
# 统计中每个城市各出现了多少次
address = df1["address"].value_counts()
address

广州    2
深圳    2
长沙    1
北京    1
武汉    1
Name: address, dtype: int64

In [52]:
type(address) # Series类型

pandas.core.series.Series

In [69]:
# 结果自动是降序排列的Series类型数据
# 索引重置
# 索引重置使用reset_index()
address_new=address.reset_index()
address_new

  index  address
0    广州        2
1    深圳        2
2    长沙        1
3    北京        1
4    武汉        1

In [70]:
type(new_address) # 变成DataFrame类型

pandas.core.frame.DataFrame

In [71]:
# 还比如我们想从数据中单独取出sex="男"的数据：
fale=df1[df1['sex']=='男']
fale

  name  age sex  score address class
0   小明   20   男    669      北京   one
2   小孙   27   男    642      广州   one
3   王小   20   男    590      武汉   two
4   关宇   28   男    601      深圳   two

In [72]:
fale_1=fale.reset_index()
fale_1

   index name  age sex  score address class
0      0   小明   20   男    669      北京   one
1      2   小孙   27   男    642      广州   one
2      3   王小   20   男    590      武汉   two
3      4   关宇   28   男    601      深圳   two

In [73]:
# 出现的结果中索引是我们想要的结果，但是出现了一列新的数据，就是原来的索引构成的数据，这不是我们想要的数据，需要去除：
fale_1 = fale.reset_index(drop=True)  # 加上参数即可解决
fale_1

  name  age sex  score address class
0   小明   20   男    669      北京   one
1   小孙   27   男    642      广州   one
2   王小   20   男    590      武汉   two
3   关宇   28   男    601      深圳   two

In [74]:
address_new

  index  address
0    广州        2
1    深圳        2
2    长沙        1
3    北京        1
4    武汉        1

In [75]:
# 属性重命名
# 使用的是rename函数，传入columsn参数：
address_new=address_new.rename(columns={'index':'address','address':'number'})
address_new

  address  number
0      广州       2
1      深圳       2
2      长沙       1
3      北京       1
4      武汉       1

In [76]:
# groupby使用
# groupby主要是实现分组统计的功能：
# 1、比如我们想统计男女各自的总分

In [77]:
df1 # 统计男女的总分

  name  age sex  score address class
0   小明   20   男    669      北京   one
1   小红   18   女    570      深圳   two
2   小孙   27   男    642      广州   one
3   王小   20   男    590      武汉   two
4   关宇   28   男    601      深圳   two
5   刘蓓   18   女    619      广州   one
6   张菲   25   女    701      长沙   one

In [78]:
# 统计男女的总成绩：sum
sex_score=df1.groupby('sex')['score'].sum()
sex_score

sex
女    1890
男    2502
Name: score, dtype: int64

In [79]:
# 2、求男女各自的平均分mean
sex_score=df1.groupby('sex')['score'].mean()
sex_score

sex
女    630.0
男    625.5
Name: score, dtype: float64

In [80]:
# 3、根据男女性别sex、班级class求总分
sex_class =df1.groupby(['sex','class'])['score'].sum() # 先根据性别、班级求总分
sex_class

sex  class
女    one      1320
     two       570
男    one      1311
     two      1191
Name: score, dtype: int64

In [81]:
# 索引重置
sex_class=sex_class.reset_index()
sex_class

  sex class  score
0   女   one   1320
1   女   two    570
2   男   one   1311
3   男   two   1191

In [82]:
# 一行代码实现上面的功能：
df1.groupby(['sex','class'])['score'].sum().reset_index()

  sex class  score
0   女   one   1320
1   女   two    570
2   男   one   1311
3   男   two   1191

In [83]:
# apply函数
# 还是上面的df1数据集：
df1

  name  age sex  score address class
0   小明   20   男    669      北京   one
1   小红   18   女    570      深圳   two
2   小孙   27   男    642      广州   one
3   王小   20   男    590      武汉   two
4   关宇   28   男    601      深圳   two
5   刘蓓   18   女    619      广州   one
6   张菲   25   女    701      长沙   one

In [85]:
# 1、需求1：我们想将性别中的男变成1，女变成0
df2=df1.copy()  # 生成一个副本
df2['sex']=df2['sex'].apply(lambda x: 1 if x =="男" else 0) # 通过匿名函数解决
df2

  name  age  sex  score address class
0   小明   20    1    669      北京   one
1   小红   18    0    570      深圳   two
2   小孙   27    1    642      广州   one
3   王小   20    1    590      武汉   two
4   关宇   28    1    601      深圳   two
5   刘蓓   18    0    619      广州   one
6   张菲   25    0    701      长沙   one

In [86]:
# 我们还可以自定义一个函数来实现：
def apply_sex(x):
    return 1 if x == "男" else 0
df3 = df1.copy()  # 生成一个副本df3
df3["sex"] = df3["sex"].apply(apply_sex)  # 通过自定义函数解决
df3

  name  age  sex  score address class
0   小明   20    1    669      北京   one
1   小红   18    0    570      深圳   two
2   小孙   27    1    642      广州   one
3   王小   20    1    590      武汉   two
4   关宇   28    1    601      深圳   two
5   刘蓓   18    0    619      广州   one
6   张菲   25    0    701      长沙   one

In [88]:
# 2、还比如我们想给每个城市的后面加上一个“市”，变成北京市、深圳市等：
df4=df1.copy()
df4['address']=df4['address'].apply(lambda x: x+'市')
df4

  name  age sex  score address class
0   小明   20   男    669     北京市   one
1   小红   18   女    570     深圳市   two
2   小孙   27   男    642     广州市   one
3   王小   20   男    590     武汉市   two
4   关宇   28   男    601     深圳市   two
5   刘蓓   18   女    619     广州市   one
6   张菲   25   女    701     长沙市   one